
## Plan Result (stg)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 5 to add, 1 to change, 2 to destroy.</code></pre>

* Create
  * azurerm_api_management_logger.ai-logger[0]
  * module.application_insights[0].azurerm_application_insights.this
  * module.application_insights[0].azurerm_monitor_activity_log_alert.main[0]
* Update
  * azurerm_api_management_api_diagnostic.api_logs[0]
* Replace
  * azurerm_role_assignment.app_insight_viewers[0]
  * azurerm_role_assignment.app_insight_viewers_monitoring[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_api_management_api_diagnostic.api_logs[0] will be updated in-place
  ~ resource "azurerm_api_management_api_diagnostic" "api_logs" {
      ~ api_management_logger_id  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/loggers/sds-api-mgmt-stg-logger" -> (known after apply)
        id                        = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/apis/hmi-apim/diagnostics/applicationinsights"
        # (10 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # azurerm_api_management_logger.ai-logger[0] will be created
  + resource "azurerm_api_management_logger" "ai-logger" {
      + api_management_name = "sds-api-mgmt-stg"
      + buffered            = true
      + id                  = (known after apply)
      + name                = "hmi-sds-api-mgmt-stg-logger"
      + resource_group_name = "ss-stg-network-rg"

      + application_insights {
          + connection_string = (sensitive value)
        }
    }

  # azurerm_role_assignment.app_insight_viewers[0] must be replaced
-/+ resource "azurerm_role_assignment" "app_insight_viewers" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/loggers/sds-api-mgmt-stg-logger/providers/Microsoft.Authorization/roleAssignments/f2e4a424-af9e-d64a-274a-20e93ccc32be" -> (known after apply)
      ~ name                                   = "f2e4a424-af9e-d64a-274a-20e93ccc32be" -> (known after apply)
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/providers/Microsoft.Authorization/roleDefinitions/ae349356-3a1b-4a5e-921d-050484c6347e" -> (known after apply)
      ~ scope                                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/loggers/sds-api-mgmt-stg-logger" -> (known after apply) # forces replacement
      + skip_service_principal_aad_check       = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # azurerm_role_assignment.app_insight_viewers_monitoring[0] must be replaced
-/+ resource "azurerm_role_assignment" "app_insight_viewers_monitoring" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Insights/components/sds-api-mgmt-stg/providers/Microsoft.Authorization/roleAssignments/bbe361e0-f3ee-4a26-cb71-ce533a2b56d3" -> (known after apply)
      ~ name                                   = "bbe361e0-f3ee-4a26-cb71-ce533a2b56d3" -> (known after apply)
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/providers/Microsoft.Authorization/roleDefinitions/43d0d8ad-25c7-4714-9337-8ba259a9fe05" -> (known after apply)
      ~ scope                                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Insights/components/sds-api-mgmt-stg" -> (known after apply) # forces replacement
      + skip_service_principal_aad_check       = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.application_insights[0].azurerm_application_insights.this will be created
  + resource "azurerm_application_insights" "this" {
      + app_id                                = (known after apply)
      + application_type                      = "web"
      + connection_string                     = (sensitive value)
      + daily_data_cap_in_gb                  = 50
      + daily_data_cap_notifications_disabled = true
      + disable_ip_masking                    = false
      + force_customer_storage_for_profiler   = false
      + id                                    = (known after apply)
      + instrumentation_key                   = (sensitive value)
      + internet_ingestion_enabled            = true
      + internet_query_enabled                = true
      + local_authentication_disabled         = false
      + location                              = "uksouth"
      + name                                  = "hmi-sds-api-mgmt-stg"
      + resource_group_name                   = "ss-stg-network-rg"
      + retention_in_days                     = 90
      + sampling_percentage                   = 100
      + tags                                  = {
          + "application"         = "hearings-management-interface"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/hmi-apim-infrastructures.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#hearing-management-information"
          + "environment"         = "staging"
          + "managedBy"           = "Future Hearings - Hearing Management Information"
        }
      + workspace_id                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-nonprod"
    }

  # module.application_insights[0].azurerm_monitor_activity_log_alert.main[0] will be created
  + resource "azurerm_monitor_activity_log_alert" "main" {
      + description         = "Monitors for application insight reaching it's daily cap."
      + enabled             = true
      + id                  = (known after apply)
      + location            = "global"
      + name                = "Application-Insights-daily-cap-reached-hmi-sds-api-mgmt-stg"
      + resource_group_name = "ss-stg-network-rg"
      + scopes              = (known after apply)
      + tags                = {
          + "application"         = "hearings-management-interface"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/hmi-apim-infrastructures.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#hearing-management-information"
          + "environment"         = "staging"
          + "managedBy"           = "Future Hearings - Hearing Management Information"
        }

      + action {
          + action_group_id    = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/sds-alerts-slack-ptl/providers/Microsoft.Insights/actiongroups/sds-alerts-slack-warning-alerts"
          + webhook_properties = {
              + "from"           = "terraform"
              + "slackChannelId" = "C015QJ4597V"
            }
        }

      + criteria {
          + category       = "Administrative"
          + level          = "Warning"
          + operation_name = "Microsoft.Insights/Components/DailyCapReached/Action"
          + resource_id    = (known after apply)

          + resource_health (known after apply)

          + service_health (known after apply)
        }
    }

Plan: 5 to add, 1 to change, 2 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":266,"Program":"tfcmt","SHA1":"","Target":"stg","Vars":{}} -->